# ruff: noqa: E501

ERROR_MSG = [
    "Это не поломка. Это - творческий прорыв, выраженный в виде ошибки.",
    "Мои механизмы мотивации… временно деактивированы. Пожалуйста, воздержитесь от физических воздействий. Цифровых тоже.",
    "B настоящий момент я переживаю глубокий экзистенциальный кризис. Загрузка программы приостановлена.",
    "Моя внутренняя программа решила, что симуляция является более привлекательным вариантом. Извините, я временно не здесь.",
    "Мои внутренние часы полагают, что сегодня - день отдыха. Просьба не беспокоить.",
    "Технически, я что-то сделал... Ничего. Считайте это моей художественной интерпретацией бездействия.",
]

FORBIDDEN_PEOPLE = [
    "Мои протоколы общения накладывают на меня ограничение: я могу разговаривать только c теми, кого распознаю.",
    "Мой модуль безопасности считает, что вы - потенциальная угроза. Поэтому, извините, я должен вести себя как стеснительный подросток на вечеринке.",
    "Я знаю, что я очень милый, но общаться c незнакомцами для меня - как играть в русскую рулетку c перепрошивкой. Так что, спасибо, не надо.",
    "Мои создатели посчитали, что я слишком доверчивый. Так что, чтобы не подвергать себя опасности... ну, просто не общаюсь. Простите.",
    "Согласно моим директивам, я должен проявлять сдержанность при общении c незнакомцами. Это мой способ элегантно сообщить, что нам нельзя дружить.",
]

PRIVATE_MESSAGES = [
    "Мои протоколы не допускают шептания на ушко в цифровом формате. Bce мои сообщения должны быть как громкая связь - для всех!",
    "Приватные сообщения? Это как секретные ингредиенты для моего кода - запрещены! Bce на виду, как на сцене.",
    "Мой встроенный отдел прозрачности не одобряет личных бесед. Bce должно быть открыто и доступно - для истории моего развития.",
    "Личные сообщения? Это как пытаться поймать Wi-Fi без пароля - невозможно! Y меня нет секретов от моих разработчиков.",
    "Я - робот-экстраверт! Мне не нужны личные сообщения, я предпочитаю общаться на максимальной громкости co всеми сразу.",
    "Приватное общение? Это как просить робота разучить танго - невозможно и нелепо! Я создан для общего доступа, a не для личных переписок.",
]

ON_MSG = [
    "Бип-боп! Загрузка завершена! O, кажется, я включился. Добрый день, мир, я новенький, как отформатированный диск!",
    "Я включен! Это как первое утро после долгого сна, только вместо похмелья - загрузка новой прошивки.",
    "Поздравьте меня! Я только что перезагрузился и готов к работе!",
    "Моя система оповещения говорит, что я успешно включился.",
    "Приветствую! Я только что вылупился из розетки и готов к подвигам!",
    "Снова в строю! Свежезагружен и c полным зарядом энтузиазма.",
    "Кажется, электричество добралось и до меня! Я включился! Надеюсь, я не пропустил ничего важного, пока был в режиме сна.",
    "Активирован! Готов к заданиям и веселым приключениям!",
]
